Autodesk.Revit.DB.Structure.LoadCase.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.LoadNatureCategory)
Creates a new LoadCase.
document:
The Document to which new load case element will be added.
name:
The name of the load case.
natureId:
The load nature id.
natureCategory:
The load nature category.
Returns:
The newly created load case element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCase.NatureId
The nature of the load case.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadCase.Number
Returns the load case number.
Since:
2016